# taps
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/bundle"
tap "homebrew/core"
tap "schniz/tap"

brew "mas"
brew "noti"
brew "trash"

# Applications
# mas "Xcode", id: 497799835

# brew "blackhole-2ch"
# brew "blackhole-16ch"

# Fonts
cask "font-hack"
cask "font-hack-nerd-font"

# Dependencies for other tools
brew "libvterm"
brew "libuv"
brew "libtermkey"
brew "unibilium"
brew "icu4c"
brew "libunistring"
brew "ncurses"

# Useful Utilities
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "bash"
brew "bash-completion2"
brew "wget", args: ["with-iri"]
brew "gnupg"
brew "gettext"
brew "pcre"
brew "pcre2"
brew "oniguruma"
brew "libidn2"
brew "xz"
brew "msgpack"
brew "openssl"
brew "gdbm"
brew "readline"
brew "watchman"

# Languages && managers
brew "asdf"
brew "python"
brew "node"
brew "go"
brew "openjdk"
brew "scala"
brew "sbt"
brew "lua"
brew "luajit"
brew "opam"
# golang static analysis - https://staticcheck.io/
brew "staticcheck"

# Command line Tools
brew "ack"
brew "cloc"
brew "diff-so-fancy"
brew "entr"
brew "fzf"
brew 'gdal'
brew "gh"
brew "gnupg"
brew "highlight"
brew "homeshick"
brew "htop"
brew "httpie"
brew "jq"
brew "lazygit"
brew "markdown"
brew "pastel"
brew "fnm"
brew "shellcheck"
brew "tree"
brew "wdiff"
brew "wget"
brew "z"

# image && video
brew "imagemagick"
brew "ffmpeg"
brew "figlet"

# REIR - Rewrite Everything In Rust
brew "bat"
brew "diskus"
brew "exa"
brew "fd"
brew "hexyl"
brew "hyperfine"
brew "ripgrep"

# more recent versions of macOS tools
brew "git"
brew "grep"
brew "openssh"
brew "screen"
brew "gmp"

# neofetch and its dependencies
brew "neofetch"
brew "w3m"
brew "terminology"
brew "kitty"
brew "libsixel"
brew "catimg"
brew "jp2a"
brew "libcaca"
brew "screenresolution"

# shells
brew "zsh"
brew "romkatv/powerlevel10k/powerlevel10k"

# GOAT tools
brew "neovim"
brew "tmux"

# software
# browsers
cask "firefox"
cask "microsoft-edge"
cask "google-chrome"
cask "google-chrome-canary"

# terminal
cask "alacritty"

# image editors
cask "gimp"

# chat software
cask "discord"

# screen recorder && utils
cask "kap"
cask "keycastr"
cask "obs"
